create_clock -period 12.500 [get_ports clk]

set_input_delay -clock [get_clocks clk] -max 5.000 [get_ports nreset]
set_input_delay -clock [get_clocks clk] -max 5.000 [get_ports buf_ready_data]
set_input_delay -clock [get_clocks clk] -max 5.000 [get_ports buf_ready_bias]
set_input_delay -clock [get_clocks clk] -max 5.000 [get_ports buf_ready_weight]
set_output_delay -clock [get_clocks clk] -max 5.000 [get_ports re_data]
set_output_delay -clock [get_clocks clk] -max 5.000 [get_ports re_bias]
set_output_delay -clock [get_clocks clk] -max 5.000 [get_ports re_weight]
set_output_delay -clock [get_clocks clk] -max 5.000 [get_ports load_en]

set_input_delay -clock [get_clocks clk] -min 3.000 [get_ports nreset]
set_input_delay -clock [get_clocks clk] -min 3.000 [get_ports buf_ready_data]
set_input_delay -clock [get_clocks clk] -min 3.000 [get_ports buf_ready_bias]
set_input_delay -clock [get_clocks clk] -min 3.000 [get_ports buf_ready_weight]
set_output_delay -clock [get_clocks clk] -min 3.000 [get_ports re_data]
set_output_delay -clock [get_clocks clk] -min 3.000 [get_ports re_bias]
set_output_delay -clock [get_clocks clk] -min 3.000 [get_ports re_weight]
set_output_delay -clock [get_clocks clk] -min 3.000 [get_ports load_en]